src/InformationRegisters/ИдентификаторыБазыЗнанийConfluence.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыБазыЗнанийConfluence</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДанныхConfluence</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСсылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БазаЗнаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БазыЗнанийConfluence</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыИнтеграцииConfluence</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИдентификаторыБазыЗнанийConfluence/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СписокПередУдалениемВопросЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='При удалении только записей об идентификаторах возможна "
		+ "рассинхронизация данных между 1С и Confluence. Вы уверены что хотите продолжить?'"), РежимДиалогаВопрос.ОКОтмена,
		60, КодВозвратаДиалога.Отмена,, КодВозвратаДиалога.Отмена);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьКонтент(Команда)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьКонтентНаСервере(ВыделенныеСтроки);
	
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область ЗавершениеНемодальныхВызовов

&НаКлиенте
Процедура СписокПередУдалениемВопросЗавершение(РезультатВопроса, ПараметрыВыполнения) Экспорт
	Если НЕ РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьЗаписиРегистраНаСервере(ПараметрыВыполнения.ВыделенныеСтроки);
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста 
Процедура УдалитьЗаписиРегистраНаСервере(знач МассивКлючи)
	Для Каждого КлючЗаписи Из МассивКлючи Цикл
		БазаЗнанийСсылка	= КлючЗаписи.БазаЗнаний;
		ЭлементСсылка		= КлючЗаписи.Элемент;
		
		УдалитьИдентификаторИзРегистраНаСервере(БазаЗнанийСсылка, ЭлементСсылка);
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура УдалитьКонтентНаСервере(знач МассивКлючи)
	Для Каждого КлючЗаписи Из МассивКлючи Цикл
		БазаЗнанийСсылка	= КлючЗаписи.БазаЗнаний;
		ЭлементСсылка		= КлючЗаписи.Элемент;
		
		НастройкиПодключения = ИнтеграцияConfluenceПереопределяемый.ПолучитьНастройкиПодключенияПоОбъекту(БазаЗнанийСсылка, ЭлементСсылка);
		Если НастройкиПодключения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторВерсия = РегистрыСведений.ИдентификаторыБазыЗнанийConfluence.ПолучитьИдентификаторВерсию(БазаЗнанийСсылка, ЭлементСсылка);
		Если НЕ ПустаяСтрока(ИдентификаторВерсия.Идентификатор) Тогда
			Результат = ИнтеграцияConfluenceКлиентСервер.УдалитьКонтент(НастройкиПодключения, ИдентификаторВерсия.Идентификатор, Истина);
			Если ИнтеграцияConfluenceКлиентСервер.ПроверитьОшибки(Результат, Истина) Тогда
				Продолжить;
			КонецЕсли;
			
			ИнтеграцияConfluenceКлиентСервер.УдалитьКонтент(НастройкиПодключения, ИдентификаторВерсия.Идентификатор, Ложь);
		КонецЕсли;
		
		УдалитьИдентификаторИзРегистраНаСервере(БазаЗнанийСсылка, ЭлементСсылка);
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура УдалитьИдентификаторИзРегистраНаСервере(знач БазаЗнанийСсылка, знач ЭлементСсылка)
	НаборЗаписей = РегистрыСведений.ИдентификаторыБазыЗнанийConfluence.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.БазаЗнаний.Установить(БазаЗнанийСсылка);
	НаборЗаписей.Отбор.Элемент.Установить(ЭлементСсылка);
	НаборЗаписей.УдалитьКонтент = Истина;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

#КонецОбласти
